data-asplos/native-vm/lighttpd-10M.txt
Running 2m test @ http://128.178.116.199:6380/random/10M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    16.27     20.06   110.00     81.97%
  1261 requests in 2.00m, 13.06GB read
  Socket errors: connect 0, read 0, write 0, timeout 1261
Requests/sec:     10.50
Transfer/sec:    111.38MB
Running 2m test @ http://128.178.116.199:6380/random/10M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    21.05     27.12   130.00     79.51%
  1003 requests in 2.00m, 13.06GB read
  Socket errors: connect 0, read 2, write 0, timeout 1003
Requests/sec:      8.35
Transfer/sec:    111.39MB
Running 2m test @ http://128.178.116.199:6380/random/10M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    19.93     23.73   121.00     84.10%
  1275 requests in 2.00m, 13.06GB read
  Socket errors: connect 0, read 2, write 0, timeout 1275
Requests/sec:     10.62
Transfer/sec:    111.39MB
Running 2m test @ http://128.178.116.199:6380/random/10M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    20.30     24.68   131.00     83.13%
  1269 requests in 2.00m, 13.06GB read
  Socket errors: connect 0, read 0, write 0, timeout 1269
Requests/sec:     10.57
Transfer/sec:    111.39MB
Running 2m test @ http://128.178.116.199:6380/random/10M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    20.50     23.48    90.00     83.00%
  1280 requests in 2.00m, 13.06GB read
  Socket errors: connect 0, read 0, write 0, timeout 1280
Requests/sec:     10.66
Transfer/sec:    111.38MB
Running 2m test @ http://128.178.116.199:6380/random/10M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    19.80     22.97   130.00     84.90%
  1276 requests in 2.00m, 13.06GB read
  Socket errors: connect 0, read 0, write 0, timeout 1276
Requests/sec:     10.62
Transfer/sec:    111.37MB
Running 2m test @ http://128.178.116.199:6380/random/10M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    16.48     21.02   131.00     83.57%
  1257 requests in 2.00m, 13.06GB read
  Socket errors: connect 0, read 2, write 0, timeout 1257
Requests/sec:     10.47
Transfer/sec:    111.37MB
Running 2m test @ http://128.178.116.199:6380/random/10M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    22.26     26.99   120.00     81.23%
  1003 requests in 2.00m, 13.06GB read
  Socket errors: connect 0, read 1, write 0, timeout 1003
Requests/sec:      8.35
Transfer/sec:    111.38MB
Running 2m test @ http://128.178.116.199:6380/random/10M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    24.34     28.99   131.00     84.57%
  1000 requests in 2.00m, 13.06GB read
  Socket errors: connect 0, read 0, write 0, timeout 1000
Requests/sec:      8.33
Transfer/sec:    111.37MB
Running 2m test @ http://128.178.116.199:6380/random/10M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    20.21     24.71   121.00     85.09%
  1272 requests in 2.00m, 13.06GB read
  Socket errors: connect 0, read 0, write 0, timeout 1272
Requests/sec:     10.59
Transfer/sec:    111.38MB